lib/services/data_inserter.rb

INSERT INTO "platforms" ("company_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["company_name", "Company A"], ["created_at", "2019-11-06 15:13:06.423273"], ["updated_at", "2019-11-06 15:13:06.423273"]]
INSERT INTO "projects" ("platform_id", "name", "funding_amount", "city", "developer_name", "duration_in_months", "interest_rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "platforms".* FROM "platforms" WHERE "platforms"."company_name" = ? ORDER BY "platforms"."id" ASC LIMIT ?  [["company_name", "Company B"], ["LIMIT", 1]]
INSERT INTO "capture_details" ("amount", "created_at", "updated_at", "project_id", "platform_id", "time") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 96231], ["created_at", "2019-11-06 15:13:06.483629"], ["updated_at", "2019-11-06 15:13:06.483629"], ["project_id", 7], ["platform_id", 5], ["time", 1493643600000]]
SELECT "projects".* FROM "projects" WHERE "projects"."name" = ? AND "projects"."platform_id" = ? ORDER BY "projects"."id" ASC LIMIT ?  [["name", "Project A"], ["platform_id", 4], ["LIMIT", 1]]
INSERT INTO "capture_details" ("amount", "created_at", "updated_at", "project_id", "platform_id", "time") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 106231], ["created_at", "2019-11-06 15:14:12.981780"], ["updated_at", "2019-11-06 15:14:12.981780"], ["project_id", 7], ["platform_id", 5], ["time", 1493730000000]]
---
    def self.call
      context = Services::DataModifier.get_data('test.json')

      platform_data = Services::DataModifier.get_platform_data(context)
      project_data = Services::DataModifier.get_project_data(context)
      capture_detail_data = Services::DataModifier.get_capture_detail_data(context)

      @platform = Platform.create(platform_data)
      if @platform.save
        @project = @platform.projects.create(project_data)
      else
        @platform = Platform.where(company_name: platform_data[:company_name]).first
        @project = @platform.projects.create(project_data)
      end

      if @project.save
        @capture_detail = @project.capture_details.create(time: capture_detail_data[:time], amount: capture_detail_data[:amount], platform_id: @platform.id)
      else
        @project = Project.where({name: project_data[:name], platform_id: @platform.id}).first
        @capture_detail = @project.capture_details.create(time: capture_detail_data[:time], amount: capture_detail_data[:amount], platform_id: @platform.id)