app/views/projects/show.html.erb

SELECT "capture_details".* FROM "capture_details" WHERE "capture_details"."project_id" = ? ORDER BY "capture_details"."time" DESC LIMIT ?  [["project_id", 9], ["LIMIT", 1]]
---
<p><b>Expected time to get fully funded: <%= calculate_funding_time(@project) %> Day(s)</b></p>
<p>Funding Progress From <%= l(@project.capture_details.order(:time).first.get_formated_date, format: '%B %d %Y') %> - <%= l(@project.capture_details.order(:time).last.get_formated_date, format: '%B %d %Y') %>:</p>

SELECT "capture_details".* FROM "capture_details" WHERE "capture_details"."project_id" = ? ORDER BY "capture_details"."id" ASC LIMIT ?  [["project_id", 8], ["LIMIT", 1]]
---
<p>The Project is online since:</p>
<p><%= l(@project.capture_details.first.get_formated_date, format: '%B %d %Y') %>  and has been online for <%= project_online_date(@project) %> day(s)</p>

SELECT "capture_details".* FROM "capture_details" WHERE "capture_details"."project_id" = ? ORDER BY "capture_details"."time" ASC LIMIT ?  [["project_id", 8], ["LIMIT", 1]]
---

<%= @project.capture_details.order(:time).first.get_formated_date %>