app/helpers/platforms_helper.rb

SELECT SUM("capture_details"."amount") FROM "capture_details" WHERE "capture_details"."platform_id" = ?  [["platform_id", 6]]
---
  def total_amount_of_invesment(platform)
    sum = CaptureDetail.where(platform_id: platform.id).sum(:amount)

SELECT "capture_details".* FROM "capture_details" WHERE "capture_details"."platform_id" = ? ORDER BY "capture_details"."amount" DESC LIMIT ?  [["platform_id", 6], ["LIMIT", 1]]
SELECT MAX("capture_details"."amount") FROM "capture_details" WHERE "capture_details"."platform_id" = ?  [["platform_id", 6]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def fastest_project(platform)
    max = CaptureDetail.where(platform_id: platform.id).order(:amount).last
    Project.find(max.project_id).name

SELECT SUM("capture_details"."amount") AS sum_amount, "capture_details"."platform_id" AS capture_details_platform_id FROM "capture_details" GROUP BY "capture_details"."platform_id"
SELECT "platforms".* FROM "platforms" WHERE "platforms"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def fastest_platform
    id = CaptureDetail.group(:platform_id).sum(:amount).sort.first.first
    Platform.find(id)