app/helpers/projects_helper.rb

SELECT "capture_details".* FROM "capture_details" WHERE "capture_details"."project_id" = ? ORDER BY "capture_details"."id" ASC LIMIT ?  [["project_id", 8], ["LIMIT", 1]]
---
  def project_online_date(project)
    (Date.today - project.capture_details.first.get_formated_date).to_i

SELECT "capture_details".* FROM "capture_details" WHERE "capture_details"."project_id" = ? ORDER BY "capture_details"."time" DESC LIMIT ?  [["project_id", 8], ["LIMIT", 1]]
---
  def overal_funding(project)
    amount = project.capture_details.order(:time).last.amount

SELECT "capture_details".* FROM "capture_details" WHERE "capture_details"."project_id" = ? ORDER BY "capture_details"."id" ASC LIMIT ?  [["project_id", 8], ["LIMIT", 1]]
SELECT COUNT(*) FROM "capture_details" WHERE "capture_details"."project_id" = ?  [["project_id", 9]]
---
  def calculate_funding_time(project)
    differences = calculate_funding_averages(project.capture_details)
    pp project.funding_amount / project.capture_details.first.amount
    expected_time = project.funding_amount / (differences.sum/differences.count)