app/controllers/platforms_controller.rb

SELECT "platforms".* FROM "platforms"
---
  def index
    @platforms = Platform.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "platforms".* FROM "platforms" WHERE "platforms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @projects = Platform.find(params[:id]).projects

SELECT "platforms".* FROM "platforms" WHERE "platforms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_platform
      @platform = Platform.find(params[:id])