app/controllers/projects_controller.rb

    def set_project
      @project = @platform.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."platform_id" = ? AND "projects"."id" = ? LIMIT ?  [["platform_id", 4], ["id", 6], ["LIMIT", 1]]

    def get_platform
      @platform = Platform.find(params[:platform_id])
---
SELECT "platforms".* FROM "platforms" WHERE "platforms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]